public class StudyInformation {
    private String infoAboutMiddleAges = "Сре́дние века́, или Средневеко́вье, — период истории Европы и Ближнего Востока, следующий после Античности и предшествующий Новому времени.\n" +
            "Историки предлагали разные хронологические рамки для этого периода, основными из которых были 500—1500 и 500—1800. \n\n" +
            "За начало Средневековья обычно принимают падение Западной Римской империи в V веке, реже IV век, характеризующийся глубоким кризисом античного общества\n" +
            "и усилением позиций христианства в Римской империи.\n\n" +
            "В результате объединения частично разрушенной западноримской социально-экономической структуры и германской протомилитомагнарной системы производственных отношений\n" +
            "возник совершенно новый общественно-экономический уклад и, соответственно, способ производства, который принято называть феодальным. Сам факт слияния порядков коренного населения\n" +
            "Западной Римской империи с германскими давно уже замечен историками, которые назвали это явление романо-германским синтезом.\n\n" +
            "Одной из самых долгих войн в средневековье была Столетняя Война Серия военных конфликтов между Англией и её союзниками с одной стороны и Францией и её союзниками с другой,\n" +
            "длившихся примерно с 1337 по 1453 год. Поводом к этим конфликтам были притязания на французский престол английской королевской династии Плантагенетов,\n" +
            "стремящейся вернуть территории на континенте, ранее принадлежавшие английским королям.\n\n" +
            "В начале XIV века период роста и процветания Европы закончился целой серией бедствий, таких как великий голод 1315—1317 годов, который случился из-за необыкновенно холодных\n" +
            "и дождливых лет, погубивших урожай. За голодом и болезнями последовала Чёрная смерть, эпидемия чумы, которая уничтожила более половины европейского населения.\n\n" +
            "Одной из определяющих черт эпохи высокого Средневековья были крестовые походы, организованные христианами с целью отвоевания у сельджуков Палестины.\n" +
            "Они соершались в XI—XV веках из Западной Европы против мусульман и не только.\n\n" +
            "В российской, английской и немецкой историографии Средневековье условно делится на три основных периода:\n"+
                    "Раннее Средневековье (конец V — середина XI века).\n"+
                    "Высокое, или Классическое, Средневековье (середина XI — конец XIV века).\n"+
                    "Позднее Средневековье (XIV—XVI века).\n\n" +
            "Начиная с XII—XIII веков в Европе произошёл резкий подъём развития технологий и увеличилось число нововведений в средствах производства, что способствовало экономическому росту региона.\n" +
            "Менее чем за столетие было сделано больше изобретений, чем за предыдущую тысячу лет.\n" +
            "Были изобретены пушки, очки, артезианские скважины. Кросс-культурные внедрения: порох, шёлк, компас и астролябия пришли с Востока. Были также большие успехи в судостроении и в часах.\n\n" +
            "В средневековье начинается проникновение европейцев на Восток. В конце XIII века венецианский путешественник Марко Поло одним из первых в Европе отправился по Великому шёлковому пути в Китай,\n" +
            "а по возвращении тщательно описал увиденное во время путешествия, открыв западному человеку мир Азии и Востока.\n\n" +
            "Возрожде́ние, или Ренесса́нс - эпоха в истории культуры Европы, пришедшая на смену культуре Средних веков и предшествующая культуре Нового времени. Примерные хронологические рамки эпохи — XIII\n" +
            "(в Италии, затем в Голландии, в остальном мире с середины XV века) — XVI века. Отличительная черта эпохи Возрождения — светский характер культуры и её антропоцентризм.\n\n"
            ;

    public void printInfoAboutMiddleAges(){
        System.out.println(infoAboutMiddleAges);
    }

    public StudyInformation() {
    }
}
