public class Test {
    Question question1 = new Question("Какой период истории принято считать Средневековьем?", "500 г. - 1500 г.", "100 г. -900 г.", "400 г. - 1400 г.", "228 г. - 322 г.", 1);
    Question question2 = new Question("С какого события принято считать начало средневековья?", "С начала первого крестового похода в 1096 г.", "С падения Западной Римской империи в 476 г.", "С начала правления византийского императора Константина IV в 668 г.", "С 14 года н.э. — смерти римского императора Октавиана Августа", 2);
    Question question3 = new Question("Как называется общественно-политический строй в средние века?", "Рабство", "Феодализм", "Матриархат", "Капитализм", 2);
    Question question4 = new Question("Между кем  с 1337 года по 1453 год состоялась серия военных конфликтов, именуемых Столетняя война?", "Франция и Германия", "Англия и Шотландия", "Англия и Франция", "Германия и Англия", 3);
    Question question5 = new Question("С 1346—1353 г. умерли десятки миллионов людей (более половины еропейского насеения) с чем это было связано?", "Крестовые походы", "Пандемия чумы, именуемая \"Черной смертью\"", "Столетняя война", "Пандемия \"Чёрной оспы\"", 2);
    Question question6 = new Question("Против кого организовывались крестовые походы?", "против викингов", "против англичан", "против французов", "против мусульман", 4);
    Question question7 = new Question("Какого периода средневековья не существует?", "Раннее Средневековье", "Высокое, или Классическое, Средневековье", "Cреднее средневековье", "Позднее Средневековье", 3);
    Question question8 = new Question("Какое из этих изобретений было изобретено не в средневековье?", "пушки", "Дамасская сталь", "артезианские скважины", "очки", 2);
    Question question9 = new Question("Какой путешественник один из первых отправился по Великому Шелковому пути из Европы?", "Марко Поло", "Христофор Колумб", "Фернан Магеллан", "Васко да Гама", 1);
    Question question10 = new Question("Какая эпоха в истории культуры Европы пришла на смену культуре Средних веков?", "эпоха Просвещения", "Неоклассицизм", "Постмодерн", "эпоха Возрождения", 4);

}
